Documents/ВыполнениеРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыполнениеРабот</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыполненныеРаботы</xr:Item>
				<xr:Item>InformationRegister.СостоянияЗаявок</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СостоянияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияЗаявок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВыполненныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВыполненныеРаботы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВыполнениеРабот/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ЭТАТ 1. РЕГИСТР СВЕДЕНИЙ: СОСТОЯНИЯ ЗАЯВОК (Строго 1 запись, вне циклов)
	Движения.СостоянияЗаявок.Записывать = Истина;
	ДвижениеСведений = Движения.СостоянияЗаявок.Добавить();
	ДвижениеСведений.Период = Дата;
	ДвижениеСведений.Заявка = Заявка;
	ДвижениеСведений.СтатусЗаявки = Перечисления.СтатусыЗаявок.Выполнена;
	ДвижениеСведений.Исполнитель = Исполнитель;  
	
	// ЭТАП 2. РЕГИСТР НАКОПЛЕНИЯ: ОСТАТКИ МАТЕРИАЛОВ (РАСХОД С ФИЛЬТРОМ УСЛУГ)
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл 
		
		// Фильтруем немат. услуги
		Если ТекСтрокаМатериалы.Номенклатура.ТипыНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		ДвижениеСклада = Движения.ОстаткиМатериалов.Добавить();
		ДвижениеСклада.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеСклада.Период = Дата;
		ДвижениеСклада.Номенклатура = ТекСтрокаМатериалы.Номенклатура;
		ДвижениеСклада.Склад = Склад;
		ДвижениеСклада.Количество = ТекСтрокаМатериалы.Количество;
		//ДвижениеСклада.Сумма = ТекСтрокаМатериалы.Сумма;
	КонецЦикла;

	// ЭТАП 3. ЗАПИСЬ СКЛАДА И КОНТРОЛЬ ОСТАТКОВ
	// Записываем складские расходы в базу ДО ТОГО, как считать выручку
	Движения.ОстаткиМатериалов.Записать(); 
	
	// Контролируем остатки только при оперативном проведении
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		
		ЗапросОстатков = Новый Запрос;
		ЗапросОстатков.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиМатериаловОстатки.Номенклатура.Наименование КАК НоменклатураНаименование,
			|	-ОстаткиМатериаловОстатки.КоличествоОстаток КАК Дефицит
			|ИЗ
			|	РегистрНакопления.ОстаткиМатериалов.Остатки(&МоментВремени, Склад = &ТекущийСклад) КАК ОстаткиМатериаловОстатки
			|ГДЕ
			|	ОстаткиМатериаловОстатки.КоличествоОстаток < 0"; // Ищем ушедшие в минус товары
		
		// Используем границу, чтобы запрос гарантированно увидел движения текущего документа
		ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
		ЗапросОстатков.УстановитьПараметр("МоментВремени", ГраницаКонтроля);
		ЗапросОстатков.УстановитьПараметр("ТекущийСклад", Склад);
		
		РезультатКонтроля = ЗапросОстатков.Выполнить(); 
		
		Если Не РезультатКонтроля.Пустой() Тогда
			Отказ = Истина; // Блокируем проведение, если найден дефицит
			
			ВыборкаМинусов = РезультатКонтроля.Выбрать();
			Пока ВыборкаМинусов.Следующий() Цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Недостаточно товара """ + ВыборкаМинусов.НоменклатураНаименование + """ на складе! Не хватает: " + ВыборкаМинусов.Дефицит + " шт.";
				Сообщение.Сообщить();
			КонецЦикла;
			
			// Если склад ушел в минус, прерываем процедуру сразу — выручку считать не нужно!
			Возврат; 
		КонецЕсли;
		
	КонецЕсли;

	// ЭТАП 4. РЕГИСТР НАКОПЛЕНИЯ: ВЫПОЛНЕННЫЕ РАБОТЫ (ПРИХОД ВЫРУЧКИ)
	Движения.ВыполненныеРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		ДвижениеВыручки = Движения.ВыполненныеРаботы.Добавить();
		ДвижениеВыручки.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВыручки.Период = Дата;
		ДвижениеВыручки.Клиент = Заказчик;
		ДвижениеВыручки.Исполнитель = Исполнитель;
		ДвижениеВыручки.Номенклатура = ТекСтрокаМатериалы.Номенклатура;
		ДвижениеВыручки.Количество = ТекСтрокаМатериалы.Количество;
		ДвижениеВыручки.Сумма = ТекСтрокаМатериалы.Сумма;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаКлиента") Тогда
		// Заполнение шапки
		Исполнитель = ДанныеЗаполнения.Исполнитель;
		Заказчик = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Заявка = ДанныеЗаполнения.Ссылка;
		СтатусЗаявки = ДанныеЗаполнения.СтатусЗаявки;
	КонецЕсли;

КонецПроцедуры
